In [1]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import numpy as np
from datetime import datetime

# 데이터 분석 입문자를 위한 파이썬 판다스 300제
https://wikidocs.net/89378  

# DataManim - 빅데이터 분석기사 실기 문제 연습
https://www.datamanim.com/dataset/99_pandas/pandasMain.html

# 5. 데이터 프레임에 함수 적용하기

## 5-1. lambda 함수
- 이름없이 간단한 함수를 만드는 것

In [2]:
df = pd.DataFrame({'a': [1, 2, 3, 4, 5], 'b': [4, 5, 6, 7, 8], 'c': [10, 20, 30, 40, 50]})
df

   a  b   c
0  1  4  10
1  2  5  20
2  3  6  30
3  4  7  40
4  5  8  50

In [4]:
def add_1(x):
    return x + 1

df['a'].map(add_1)
df['a'].map(lambda x: x+1)
df['a'].map(lambda x: True if x == 1 else False)

0     True
1    False
2    False
3    False
4    False
Name: a, dtype: bool

## 5-2. map() / apply() / applymap() 비교
- map() : 단일 컬럼(Series)에 적용
- apply() : DataFrame의 행 or 열에 적용
- applymap() : 개별 값에 적용

In [10]:
df['a'].map(lambda x: display(x))

1

2

3

4

5

0    None
1    None
2    None
3    None
4    None
Name: a, dtype: object

In [15]:
test = {1:'일', 2: '이'}
df['d'] = df['a'].map(test)
df.drop(columns='d', inplace=True)

In [17]:
df

   a  b   c
0  1  4  10
1  2  5  20
2  3  6  30
3  4  7  40
4  5  8  50

# df['a'] - df['b'] => df['d']

In [28]:
df['d'] = df.apply(lambda x: x['a'] - x['b'], axis=1)

In [31]:
df.drop(columns=['sum', 'd'], inplace=True)

In [33]:
df

   a  b   c
0  1  4  10
1  2  5  20
2  3  6  30
3  4  7  40
4  5  8  50

In [35]:
df[['a', 'b']].applymap(lambda x: x+1)

   a  b
0  2  5
1  3  6
2  4  7
3  5  8
4  6  9

# 연습문제
- dataset/titanic.csv 사용

## Q1. 성별을 'male'은 0으로, 'female'은 1로 변환하여 새로운 열 'gender_num'로 추가하세요.

In [36]:
df = pd.read_csv('dataset/titanic.csv')

In [37]:
df.head(1)

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [40]:
gender_map = {'male': 0, 'female': 1}
df['gender'].map(gender_map)
df['gender'].map(lambda x: 0 if x == 'male' else 1)
df['gender_num'] = np.where(df['gender'] == 'male', 0, 1)

array(['male', 'female'], dtype=object)

## Q2. 탑승 항구 embarked를 'S'는 'Southampton', 'C'는 'Cherbourg', 'Q'는 'Queenstown'으로 매핑하여 새로운 열 'embarked_port'로 추가하세요.

In [55]:
emb_map = {'S': 'Southampton', 'C': 'Cherbourg', 'Q': 'Queenstown'}
df['embarked_port'] = df['embarked'].map(emb_map)

def get_emp_port(x):
    if x == 'S':
        return 'Southampton'
    elif x == 'C':
        return 'Cherbourg'
    else:
        return 'Queenstown'
    
df['embarked'].map(get_emp_port)

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embarked, Length: 891, dtype: object

## Q3. 이름의 길이가 20자 이상이면 '긴 이름', 10자 이상이면 '중간 이름', 그 외에는 '짧은 이름'을 반환하는 함수를 작성하고, 이를 'Name_Length_Class' 열에 적용하세요.

In [44]:
def get_length(name):
    if len(name) >= 20:
        return '긴 이름'
    elif len(name) >= 10:
        return '중간 이름'
    else:
        return '짧은 이름'
    
df['Name_Length_Class'] = df['name'].map(get_length)

0       긴 이름
1       긴 이름
2       긴 이름
3       긴 이름
4       긴 이름
       ...
886     긴 이름
887     긴 이름
888     긴 이름
889     긴 이름
890    중간 이름
Name: name, Length: 891, dtype: object

## Q4. 선실 등급(pclass)이 1인 승객의 운임 요금(fare)을 1.5배로 계산하고,  선실 등급이 2인 승객의 운임 요금은 해당 승객의 운임 요금을 1.2배로,  선실 등급이 3인 승객의 운임 요금은 그대로 유지하여  조정된 운임요금 열 'adj_fare'를 추가하세요.

In [52]:
def get_adj_fare(x):
    if x['pclass'] == 1:
        return x['fare'] * 1.5
    elif x['pclass'] == 2:
        return x['fare'] * 1.2
    else:
        return x['fare']

In [54]:
df['adj_fare'] = df[['pclass', 'fare']].apply(get_adj_fare, axis=1)

# 6. 날짜 데이터 처리
- 'dataset/AirQualityUCI.csv' 데이터 사용
- T: 온도
- RH: 상대습도
- AH: 절대 습도

In [67]:
df = pd.read_csv('dataset/AirQualityUCI.csv')

In [70]:
df['datetime'] = pd.to_datetime(df['datetime'])

In [71]:
df.head()

             datetime      T         RH        AH
0 2004-03-10 18:00:00  13.60  48.875001  0.757754
1 2004-03-10 19:00:00  13.30  47.700000  0.725487
2 2004-03-10 20:00:00  11.90  53.975000  0.750239
3 2004-03-10 21:00:00  11.00  60.000000  0.786713
4 2004-03-10 22:00:00  11.15  59.575001  0.788794

## 6-1. 필요한 정보 추출하기
- dt.date
- dt time
---
- dt.year
- dt.month
- dt.day
- dt.hour
- dt.minute
- dt.second
---
- dt.weekday : The day of the week with Monday=0, Sunday=6.
- datetime.strptime(x, '%Y-%m-%d').strftime('%w') : Sunday=0, Saturday=6

In [73]:
df.head(1)

             datetime     T         RH        AH
0 2004-03-10 18:00:00  13.6  48.875001  0.757754

In [82]:
df['date'] = df['datetime'].dt.date
df['time'] = df['datetime'].dt.time

df['year'] = df['datetime'].dt.year
df['month'] = df['datetime'].dt.month
df['day'] = df['datetime'].dt.day

df['hour'] = df['datetime'].dt.hour
df['minute'] = df['datetime'].dt.minute
df['second'] = df['datetime'].dt.second

In [84]:
df['datetime'].dt.weekday

0       2
1       2
2       2
3       2
4       2
       ..
9352    0
9353    0
9354    0
9355    0
9356    0
Name: datetime, Length: 9357, dtype: int64

In [88]:
df['datetime'] = df['datetime'].astype(str)

### map,  datetime.strptime(x, '%Y-%m-%d %H:%M:%S').strftime('%w') 활용해서 'weekday' 컬럼 추가

In [91]:
df['date'].astype(str).\
    map(lambda x: datetime.strptime(x, '%Y-%m-%d').strftime('%w'))

df['datetime'].astype(str).\
    map(lambda x: datetime.strptime(x, '%Y-%m-%d %H:%M:%S').strftime('%w'))

0       3
1       3
2       3
3       3
4       3
       ..
9352    1
9353    1
9354    1
9355    1
9356    1
Name: datetime, Length: 9357, dtype: object

## 6-2. 날짜 인덱싱

In [92]:
df['datetime'] = pd.to_datetime(df['datetime'])

In [97]:
df[df['datetime'] < '2005-01-01'].head()

,datetime,T,RH,AH,date,time,year,month,day,hour,minute,second
0,2004-03-10 18:00:00,13.60,48.875001,0.757754,2004-03-10,18:00:00,2004,3,10,18,0,0
1,2004-03-10 19:00:00,13.30,47.700000,0.725487,2004-03-10,19:00:00,2004,3,10,19,0,0
2,2004-03-10 20:00:00,11.90,53.975000,0.750239,2004-03-10,20:00:00,2004,3,10,20,0,0
3,2004-03-10 21:00:00,11.00,60.000000,0.786713,2004-03-10,21:00:00,2004,3,10,21,0,0
4,2004-03-10 22:00:00,11.15,59.575001,0.788794,2004-03-10,22:00:00,2004,3,10,22,0,0

# 7. 데이터 집계와 그룹연산
- groupby
- crosstab
- pivot_table

In [109]:
df = pd.read_csv('dataset/titanic.csv')
df.head(1)

,passengerId,survived,pclass,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [116]:
df.groupby(['pclass', 'survived'])['fare'].mean().unstack('pclass')

pclass            1          2          3
survived
0         64.684008  19.412328  13.669364
1         95.608029  22.055700  13.694887

## 7-1. groupby

## Q. 클래스(pclass)와 생존여부(survived)별 운임(fare)의 합을 구하세요.

In [121]:
df.groupby(['pclass', 'survived'])['fare'].agg(['mean', 'sum', 'std', 'var'])

                      mean         sum        std          var
pclass survived
1      0         64.684008   5174.7206  60.662089  3679.889076
       1         95.608029  13002.6919  85.286820  7273.841710
2      0         19.412328   1882.9958  15.307175   234.309611
       1         22.055700   1918.8459  10.853502   117.798505
3      0         13.669364   5085.0035  12.118338   146.854107
       1         13.694887   1629.6916  10.692993   114.340104

## 7-2. crosstab

## 성별(gender)과 생존 여부(survived)에 대한 교차표

In [128]:
pd.crosstab(index=df['gender'], columns=df['survived'])

survived    0    1
gender
female     81  233
male      468  109

## 7-3. pivot_table
- 연속형 데이터의 통계 및 집계를 수행하는데 주로 사용

## 클래스(pclass)와 생존여부(survived)별 운임(fare)의 평균을 구하세요.

In [136]:
pd.pivot_table(df,
               index='pclass',
               columns='survived',
               values='fare',
               aggfunc='mean'
              )

survived          0          1
pclass
1         64.684008  95.608029
2         19.412328  22.055700
3         13.669364  13.694887

## 연습문제
- dataset/diamonds.csv 사용

| 컬럼명      | 설명                                                         |
|-------------|--------------------------------------------------------------|
| carat       | 다이아몬드의 무게(carat)                                      |
| cut         | 다이아몬드의 귀빛(cut) 등급                                  |
| color       | 다이아몬드의 색상(color) 등급                                 |
| clarity     | 다이아몬드의 투명도(clarity) 등급                             |
| depth       | 다이아몬드의 심도(depth) 비율                                 |
| table       | 다이아몬드의 상단 테이블(table) 너비 비율                    |
| price       | 다이아몬드의 가격(price)                                      |
| x           | 다이아몬드의 가로 길이(x)                                     |
| y           | 다이아몬드의 세로 길이(y)                                     |
| z           | 다이아몬드의 깊이(z)

## Q1.  다이아몬드의 cut 등급에 따른 평균 가격 계산하기

In [137]:
df = pd.read_csv('dataset/diamonds.csv')

In [140]:
df.groupby('cut')['price'].mean().reset_index()

         cut        price
0       Fair  2793.612903
1       Good  2185.303371
2      Ideal  2503.051051
3    Premium  2554.372414
4  Very Good  2365.309735

In [141]:
pd.pivot_table(df, index='cut', values='price', aggfunc='mean').reset_index()

         cut        price
0       Fair  2793.612903
1       Good  2185.303371
2      Ideal  2503.051051
3    Premium  2554.372414
4  Very Good  2365.309735

## Q2. 다이아몬드의 color 등급과 clarity 등급에 따른 빈도표 만들기

In [146]:
df.groupby(['color', 'clarity']).size().unstack('clarity')
pd.crosstab(index=df['color'], columns=df['clarity'])

clarity   I1   IF   SI1   SI2   VS1   VS2  VVS1  VVS2
color
D        1.0  NaN  60.0  22.0   9.0  23.0   7.0   7.0
E        4.0  3.0  87.0  25.0  33.0  65.0   9.0  14.0
F        7.0  3.0  44.0  33.0  58.0  59.0  13.0   9.0
G        3.0  6.0  28.0  20.0  26.0  34.0   5.0  17.0
H        6.0  1.0  39.0  27.0  15.0  15.0  14.0   8.0
I        6.0  1.0  30.0  16.0  13.0  13.0  10.0   6.0
J        2.0  NaN  18.0  11.0   5.0   9.0   NaN   1.0

## Q3. 다이아몬드의 cut 등급에 따른 carat 평균과 가격 중간값 계산하기

In [151]:
df.groupby('cut').apply(lambda x: pd.Series({'carat': x['carat'].mean(),
                                             'price': x['price'].median()}))

df.groupby('cut').agg({'carat': 'mean', 'price': 'median'})

              carat   price
cut
Fair       0.900806  2843.5
Good       0.645281  2801.0
Ideal      0.666306  2822.0
Premium    0.709828  2822.0
Very Good  0.656062  2809.5

# 8. 그룹별 함수적용

In [166]:
df = pd.read_csv('dataset/titanic.csv')
df = df[['gender', 'fare']].head()

In [167]:
df

   gender     fare
0    male   7.2500
1  female  71.2833
2  female   7.9250
3  female  53.1000
4    male   8.0500

## 8-1. apply()

In [168]:
agg_mean = df.groupby('gender')['fare'].mean().reset_index()
agg_mean

   gender       fare
0  female  44.102767
1    male   7.650000

In [169]:
pd.merge(df, agg_mean, on='gender', how='left').rename(colums={~~~`})

SyntaxError: invalid syntax (3438336550.py, line 1)

## 8-2. transform()
- 적용대상: 주로 데이터프레임의 열에 사용, 그룹별로 통계적 계산 수행할때 사용
- 용도: 열에 대한 그룹별 연산을 수행하고
- 반환값: 기존 데이터프레임과 같은 형태로 변형하여 반환

In [170]:
df

   gender     fare
0    male   7.2500
1  female  71.2833
2  female   7.9250
3  female  53.1000
4    male   8.0500

In [171]:
df['fare_mean'] = df.groupby('gender')['fare'].transform(lambda x: x.mean())

In [172]:
df.iloc[1, 1] = np.nan

In [173]:
df['fare'] = df.groupby('gender')['fare'].transform(lambda x: x.fillna(value=x.mean()))

In [174]:
df

   gender     fare  fare_mean
0    male   7.2500   7.650000
1  female  30.5125  44.102767
2  female   7.9250  44.102767
3  female  53.1000  44.102767
4    male   8.0500   7.650000

# 1. age의 결측치를 pclass별 age 중간값으로 대체하세요.
# 2. plcass별 탑승자수를 new_column으로 정의하세요.(기존 데이터프레임 인덱스 유지)

In [178]:
df = pd.read_csv('dataset/titanic.csv')

In [179]:
df.isna().sum()

passengerId      0
survived         0
pclass           0
name             0
gender           0
age            177
sibsp            0
parch            0
ticket           0
fare             0
cabin          687
embarked         2
dtype: int64

In [185]:
df['age'] = df.groupby('pclass')['age'].transform(lambda x: x.fillna(value=x.median()))

In [187]:
df['new_column'] = df.groupby('pclass')['passengerId'].transform(lambda x: x.nunique())

# 연습문제
- dataset/titanic.csv 활용

## Q2. titanic 데이터셋에서 age의 결측치를 그 승객의 성별의 평균나이로 대체하세요.

In [188]:
df = pd.read_csv('dataset/titanic.csv')

In [189]:
df.groupby('gender')['age'].transform(lambda x: x.fillna(value=x.mean()))

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    27.915709
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64